{"def": 0, "fetch": 1, "(": 2, "self": 3, ",": 4, "requirement": 5, "tmpdir": 6, "force_scan": 7, "=": 8, "False": 9, "source": 10, ")": 11, ":": 12, "\"\"\"": 13, "Obtain": 14, "a": 15, "file": 16, "suitable": 17, "for": 18, "fulfilling": 19, "`requirement`": 20, "": 21, "static": 22, "PyObject": 23, "*": 24, "parsestr": 25, "const": 26, "char": 27, "s": 28, "encoding": 29, "{": 30, "size_t": 31, "len": 32, ";": 33, "int": 34, "quote": 35, "Py_CHARMASK": 36, "rawmode": 37, "0": 38, "need_encoding": 39, "unicode": 40, "if": 41, "isalpha": 42, "||": 43, "==": 44, "'": 45, "++": 46, "1": 47, "}": 48, "!=": 49, "\\'": 50, "&&": 51, "\\\"": 52, "PyErr_BadInternalCall": 53, "return": 54, "NULL": 55, "strlen": 56, ">": 57, "INT_MAX": 58, "PyErr_SetString": 59, "PyExc_OverflowError": 60, "\"string to parse is too long\"": 61, "[": 62, "--": 63, "]": 64, ">=": 65, "4": 66, "+=": 67, "2": 68, "-=": 69, "#ifdef": 70, "Py_USING_UNICODE": 71, "Py_UnicodeFlag": 72, "decode_unicode": 73, "#endif": 74, "strcmp": 75, "\"utf-8\"": 76, "\"iso-8859-1\"": 77, "strchr": 78, "\\\\": 79, "#ifndef": 80, "Py_FatalError": 81, "\"cannot deal with encodings in this build.\"": 82, "#else": 83, "v": 84, "u": 85, "PyUnicode_DecodeUTF8": 86, "PyUnicode_AsEncodedString": 87, "Py_DECREF": 88, "else": 89, "PyString_FromStringAndSize": 90, "PyString_DecodeEscape": 91, "?": 92, "NPY_NO_EXPORT": 93, "PyArray_As1D": 94, "op": 95, "ptr": 96, "d1": 97, "typecode": 98, "PyExc_NotImplementedError": 99, "\"PyArray_As1D: use PyArray_AsCArray.\"": 100, "-1": 101, "np": 102, ".": 103, "diagflat": 104, "l50": 105, "time_triu_l10x10": 106, "triu": 107, "l10x10": 108, "time_tril_l10x10": 109, "tril": 110, "class": 111, "Temporaries": 112, "Benchmark": 113, "setup": 114, "amid": 115, "ones": 116, "50000": 117, "bmid": 118, "alarge": 119, "1000000": 120, "blarge": 121, "time_mid": 122, "+": 123, "time_mid2": 124, "-": 125, "time_large": 126, "time_large2": 127, "CorrConv": 128, "params": 129, "50": 130, "1000": 131, "1e5": 132, "10": 133, "100": 134, "1e4": 135, "'valid'": 136, "'same'": 137, "'full'": 138, "param_names": 139, "'size1'": 140, "'size2'": 141, "'mode'": 142, "array_sort": 143, "PyArrayObject": 144, "args": 145, "kwds": 146, "axis": 147, "val": 148, "NPY_SORTKIND": 149, "sortkind": 150, "NPY_QUICKSORT": 151, "order": 152, "PyArray_Descr": 153, "saved": 154, "newd": 155, "kwlist": 156, "\"axis\"": 157, "\"kind\"": 158, "\"order\"": 159, "!": 160, "PyArg_ParseTupleAndKeywords": 161, "\"|iO&O:sort\"": 162, "&": 163, "PyArray_SortkindConverter": 164, "Py_None": 165, "new_name": 166, "_numpy_internal": 167, "PyArray_DESCR": 168, "PyDataType_HASFIELDS": 169, "PyExc_ValueError": 170, "\"Cannot specify \"": 171, "\"order when the array has no fields.\"": 172, "PyImport_ImportModule": 173, "\"numpy.core._internal\"": 174, "PyObject_CallMethod": 175, "\"_newnames\"": 176, "\"OO\"": 177, "PyArray_DescrNew": 178, "->": 179, "names": 180, "PyArrayObject_fields": 181, "descr": 182, "PyArray_Sort": 183, "Py_XDECREF": 184, "<": 185, "Py_RETURN_NONE": 186, "_wrap_union_result": 187, "other": 188, "result": 189, "name": 190, "None": 191, "type": 192, "Index": 193, "_load": 194, "libname": 195, "mode": 196, "try": 197, "pathname": 198, "_dyld_find": 199, "except": 200, "ValueError": 201, "raise": 202, "OSError": 203, "\"Library %s could not be found\"": 204, "%": 205, "load_library": 206, "handle_remote_askpass": 207, "msg": 208, "str": 209, "from": 210, "shm": 211, "import": 212, "SharedMemory": 213, "with": 214, "readonly": 215, "True": 216, "as": 217, "seek": 218, "data": 219, "json": 220, "loads": 221, "read_data_with_size": 222, "arr_ravel_multi_index": 223, "i": 224, "mode0": 225, "coords0": 226, "ret": 227, "PyArray_Dims": 228, "dimensions": 229, "npy_intp": 230, "ravel_strides": 231, "NPY_MAXDIMS": 232, "NPY_ORDER": 233, "NPY_CORDER": 234, "NPY_CLIPMODE": 235, "modes": 236, "NPY_MAXARGS": 237, "dtype": 238, "npy_uint32": 239, "op_flags": 240, "NpyIter": 241, "iter": 242, "\"multi_index\"": 243, "\"dims\"": 244, "\"mode\"": 245, "memset": 246, "sizeof": 247, "\"OO&|OO&:ravel_multi_index\"": 248, "PyArray_IntpConverter": 249, "PyArray_OrderConverter": 250, "goto": 251, "fail": 252, "\"too many dimensions passed to ravel_multi_index\"": 253, "PyArray_ConvertClipmodeSequence": 254, "switch": 255, "case": 256, "npy_mul_with_overflow_intp": 257, "\"invalid dims: array size defined by dims is larger \"": 258, "\"than the maximum possible size.\"": 259, "break": 260, "NPY_FORTRANORDER": 261, "default": 262, "\"only 'C' or 'F' order is permitted\"": 263, "int_sequence_to_arrays": 264, "NPY_ITER_READONLY": 265, "|": 266, "NPY_ITER_ALIGNED": 267, "NPY_ITER_WRITEONLY": 268, "NPY_ITER_ALLOCATE": 269, "PyArray_DescrFromType": 270, "NPY_INTP": 271, "<=": 272, "NpyIter_MultiNew": 273, "NPY_ITER_BUFFERED": 274, "NPY_ITER_EXTERNAL_LOOP": 275, "NPY_ITER_ZEROSIZE_OK": 276, "NPY_KEEPORDER": 277, "NPY_SAME_KIND_CASTING": 278, "NpyIter_GetIterSize": 279, "NpyIter_IterNextFunc": 280, "iternext": 281, "dataptr": 282, "strides": 283, "countptr": 284, "NpyIter_GetIterNext": 285, "NpyIter_GetDataPtrArray": 286, "NpyIter_GetInnerStrideArray": 287, "NpyIter_GetInnerLoopSizePtr": 288, "do": 289, "ravel_multi_index_loop": 290, "NPY_SUCCEED": 291, "while": 292, "NpyIter_GetOperandArray": 293, "Py_INCREF": 294, "npy_free_cache_dim_obj": 295, "NpyIter_Deallocate": 296, "PyArray_Return": 297, "_new_reference": 298, "obj": 299, "out": 300, "__init__": 301, "usage": 302, "option_list": 303, "option_class": 304, "Option": 305, "version": 306, "conflict_handler": 307, "\"error\"": 308, "description": 309, "formatter": 310, "add_help_option": 311, "prog": 312, "OptionContainer": 313, "set_usage": 314, "allow_interspersed_args": 315, "process_default_values": 316, "is": 317, "IndentedHelpFormatter": 318, "set_parser": 319, "_mk_dual_path_wrapper": 320, "original": 321, "getattr": 322, "_os": 323, "wrap": 324, "src": 325, "dst": 326, "**": 327, "kw": 328, "_active": 329, "_remap_pair": 330, "_selection_changed": 331, "\"\"\"Should be called when the selection of the Listbox has changed.        Updates the Listbox display and calls _change_start.\"\"\"": 332, "cursel": 333, "listbox": 334, "curselection": 335, "see": 336, "lts": 337, "lasttypedstart": 338, "selstart": 339, "completions": 340, "_binary_search": 341, "newstart": 342, "and": 343, "_change_start": 344, "gzopen": 345, "cls": 346, "\"r\"": 347, "fileobj": 348, "compresslevel": 349, "9": 350, "\"\"\"Open gzip compressed tar archive name for reading or writing.           Appending is not allowed.        \"\"\"": 351, "or": 352, "not": 353, "in": 354, "\"rw\"": 355, "\"mode must be 'r' or 'w'\"": 356, "gzip": 357, "GzipFile": 358, "ImportError": 359, "AttributeError": 360, "CompressionError": 361, "\"gzip module is not available\"": 362, "close": 363, "_sock": 364, "_closedsocket": 365, "send": 366, "recv": 367, "sendto": 368, "recvfrom": 369, "_dummy": 370, "LOCAL": 371, "SRE_CHARSET": 372, "SRE_CODE": 373, "set": 374, "ch": 375, "ok": 376, "SRE_OP_FAILURE": 377, "SRE_OP_LITERAL": 378, "SRE_OP_CATEGORY": 379, "sre_category": 380, "SRE_OP_CHARSET": 381, "256": 382, ">>": 383, "<<": 384, "15": 385, "16": 386, "5": 387, "31": 388, "8": 389, "SRE_OP_RANGE": 390, "SRE_OP_NEGATE": 391, "SRE_OP_BIGCHARSET": 392, "count": 393, "block": 394, "unsigned": 395, "128": 396, "255": 397, "~": 398, "65535": 399, "64": 400, "array_implement_c_array_function_creation": 401, "function_name": 402, "kwargs": 403, "Py_NotImplemented": 404, "PyDict_Contains": 405, "npy_ma_str_like": 406, "relevant_args": 407, "PyTuple_Pack": 408, "PyDict_GetItem": 409, "PyDict_DelItem": 410, "numpy_module": 411, "PyImport_Import": 412, "npy_ma_str_numpy": 413, "public_api": 414, "PyObject_GetAttrString": 415, "PyCallable_Check": 416, "PyErr_Format": 417, "PyExc_RuntimeError": 418, "\"numpy.%s is not callable.\"": 419, "array_implement_array_function_internal": 420, "finalize_options": 421, "pass": 422, "u'Directory'": 423, "u'Directory_Parent'": 424, "u'Y'": 425, "u'Identifier'": 426, "u'Reference to the entry in this table specifying the default parent directory. A record parented to itself or with a Null parent represents a root of the install tree.'": 427, "u'CreateFolder'": 428, "u'Component_'": 429, "u'N'": 430, "u'Component'": 431, "u'Foreign key into the Component table.'": 432, "u'Directory_'": 433, "u'Primary key, could be foreign key into the Directory table.'": 434, "u'CustomAction'": 435, "u'Type'": 436, "16383": 437, "u'The numeric custom action type, consisting of source location, code type, entry, option flags.'": 438, "u'Action'": 439, "u'Primary key, name of action, normally appears in sequence table unless private use.'": 440, "u'Source'": 441, "u'CustomSource'": 442, "u'The table reference of the source of the code.'": 443, "u'Target'": 444, "u'Formatted'": 445, "u'Excecution parameter, depends on the type of custom action'": 446, "u'DrLocator'": 447, "u'Signature_'": 448, "u'The Signature_ represents a unique file signature and is also the foreign key in the Signature table.'": 449, "u'Path'": 450, "u'AnyPath'": 451, "u'The path on the user system. This is a either a subpath below the value of the Parent or a full path. The path may contain properties enclosed within [ ] that will be expanded.'": 452, "u'Depth'": 453, "32767": 454, "u'The depth below the path to which the Signature_ is recursively searched. If absent, the depth is assumed to be 0.'": 455, "u'Parent'": 456, "u'The parent file signature. It is also a foreign key in the Signature table. If null and the Path column does not expand to a full path, then all the fixed drives of the user system are searched using the Path.'": 457, "u'DuplicateFile'": 458, "u'File_'": 459, "u'File'": 460, "u'Foreign key referencing the source file to be duplicated.'": 461, "u'Foreign key referencing Component that controls the duplicate file.'": 462, "u'DestFolder'": 463, "u'Name of a property whose value is assumed to resolve to the full pathname to a destination folder.'": 464, "u'DestName'": 465, "u'Filename'": 466, "u'Filename to be given to the duplicate file.'": 467, "u'FileKey'": 468, "u'Primary key used to identify a particular file entry'": 469, "u'Environment'": 470, "u'Name'": 471, "u'Text'": 472, "u'The name of the environmental value.'": 473, "u'Value'": 474, "u'The value to set in the environmental settings.'": 475, "u'Foreign key into the Component table referencing component that controls the installing of the environmental value.'": 476, "u'Unique identifier for the environmental variable setting'": 477, "u'Error'": 478, "u'Integer error number, obtained from header file IError(...) macros.'": 479, "u'Message'": 480, "u'Template'": 481, "u'Error formatting template, obtained from user ed. or localizers.'": 482, "u'Extension'": 483, "u'Feature_'": 484, "u'Feature'": 485, "u'Required foreign key into the Feature Table, specifying the feature to validate or install in order for the CLSID factory to be operational.'": 486, "u'Required foreign key into the Component Table, specifying the component for which to return a path when called through LocateComponent.'": 487, "u'The extension associated with the table row.'": 488, "check_site_dir": 489, "\"\"\"Verify that self.install_dir is .pth-capable dir, if needed\"\"\"": 490, "adapt_date": 491, "isoformat": 492, "adapt_datetime": 493, "\" \"": 494, "convert_date": 495, "datetime": 496, "date": 497, "map": 498, "split": 499, "\"-\"": 500, "convert_timestamp": 501, "datepart": 502, "timepart": 503, "year": 504, "month": 505, "day": 506, "timepart_full": 507, "\".\"": 508, "hours": 509, "minutes": 510, "seconds": 511, "\":\"": 512, "microseconds": 513, "float": 514, "\"0.\"": 515, "register_adapter": 516, "PyDoc_STRVAR": 517, "s__doc__": 518, "\"Compiled struct object\"": 519, "#define": 520, "OFF": 521, "x": 522, " offsetof(PyStructObject, x)": 523, "PyMemberDef": 524, "s_memberlist": 525, "\"format\"": 526, "T_OBJECT": 527, "s_format": 528, "RO": 529, "\"struct format string\"": 530, "\"size\"": 531, "T_INT": 532, "s_size": 533, "\"struct size in bytes\"": 534, "\"_len\"": 535, "s_len": 536, "\"number of items expected in tuple\"": 537, "PyTypeObject": 538, "PyStructType": 539, "PyObject_HEAD_INIT": 540, "PyType_Type": 541, "\"Struct\"": 542, "PyStructObject": 543, "destructor": 544, "s_dealloc": 545, "PyObject_GenericGetAttr": 546, "PyObject_GenericSetAttr": 547, "Py_TPFLAGS_DEFAULT": 548, "Py_TPFLAGS_BASETYPE": 549, "Py_TPFLAGS_HAVE_WEAKREFS": 550, "offsetof": 551, "weakreflist": 552, "s_methods": 553, "s_init": 554, "PyType_GenericAlloc": 555, "s_new": 556, "PyObject_Del": 557, "check_submodules": 558, "\"\"\" verify that the submodules are checked out and clean        use `git submodule update --init`; on failure    \"\"\"": 559, "os": 560, "path": 561, "exists": 562, "'.git'": 563, "open": 564, "'.gitmodules'": 565, "f": 566, "l": 567, "'path'": 568, "p": 569, "'='": 570, "strip": 571, "'Submodule %s missing'": 572, "proc": 573, "subprocess": 574, "Popen": 575, "'git'": 576, "'submodule'": 577, "'status'": 578, "stdout": 579, "PIPE": 580, "status": 581, "_": 582, "communicate": 583, "decode": 584, "\"ascii\"": 585, "\"replace\"": 586, "line": 587, "splitlines": 588, "startswith": 589, "'-'": 590, "'+'": 591, "'Submodule not clean: %s'": 592, "get_nbo_cast_numeric_transfer_function": 593, "aligned": 594, "src_stride": 595, "dst_stride": 596, "src_type_num": 597, "dst_type_num": 598, "PyArray_StridedUnaryOp": 599, "out_stransfer": 600, "NpyAuxData": 601, "out_transferdata": 602, "PyTypeNum_ISCOMPLEX": 603, "PyTypeNum_ISBOOL": 604, "npy_cache_import": 605, "\"numpy.core\"": 606, "\"ComplexWarning\"": 607, "NPY_FAIL": 608, "PyErr_WarnEx": 609, "\"Casting complex values to real discards \"": 610, "\"the imaginary part\"": 611, "PyArray_GetStridedNumericCastFn": 612, "\"unexpected error in GetStridedNumericCastFn\"": 613, "_darwin_compiler_fixup": 614, "compiler_so": 615, "cc_args": 616, "\"\"\"    This function will strip '-isysroot PATH' and '-arch ARCH' from the    compile flags if the user has specified one them in extra_compile_flags.    This is needed because '-arch ARCH' adds another architecture to the    build, without a way to remove an architecture. Furthermore GCC will    barf if multiple '-isysroot' arguments are present.    \"\"\"": 617, "stripArch": 618, "stripSysroot": 619, "list": 620, "kernel_version": 621, "uname": 622, "major_version": 623, "'.'": 624, "'-arch'": 625, "'-isysroot'": 626, "index": 627, "del": 628, "\"\"\"Close the _Stream object. No operation should be           done on it afterwards.        \"\"\"": 629, "closed": 630, "\"w\"": 631, "comptype": 632, "\"tar\"": 633, "buf": 634, "cmp": 635, "flush": 636, "blocks": 637, "remainder": 638, "divmod": 639, "bufsize": 640, "NUL": 641, "write": 642, "\"\"": 643, "\"gz\"": 644, "struct": 645, "pack": 646, "\"<l\"": 647, "crc": 648, "\"<L\"": 649, "pos": 650, "0xffffFFFFL": 651, "get_script_header": 652, "script_text": 653, "executable": 654, "sys_executable": 655, "\"\"\"Create a #! line, getting options (if any) from script_text\"\"\"": 656, "distutils": 657, "command": 658, "build_scripts": 659, "first_line_re": 660, "first": 661, "rest": 662, "'\\n'": 663, "match": 664, "options": 665, "''": 666, "group": 667, "' '": 668, "\"#!%(executable)s%(options)s\\n\"": 669, "locals": 670, "PyImport_ImportFrozenModule": 671, "_frozen": 672, "find_frozen": 673, "co": 674, "m": 675, "ispackage": 676, "size": 677, "code": 678, "PyExc_ImportError": 679, "\"Excluded frozen object named %.200s\"": 680, "Py_VerboseFlag": 681, "PySys_WriteStderr": 682, "\"import %s # frozen%s\\n\"": 683, "\" package\"": 684, "PyMarshal_ReadObjectFromString": 685, "PyCode_Check": 686, "PyExc_TypeError": 687, "\"frozen object %.200s is not a code object\"": 688, "d": 689, "err": 690, "PyImport_AddModule": 691, "PyModule_GetDict": 692, "PyString_InternFromString": 693, "PyDict_SetItemString": 694, "\"__path__\"": 695, "PyImport_ExecCodeModuleEx": 696, "\"<frozen>\"": 697, "PyUnicodeEncodeError_Create": 698, "Py_UNICODE": 699, "object": 700, "Py_ssize_t": 701, "length": 702, "start": 703, "end": 704, "reason": 705, "PyObject_CallFunction": 706, "PyExc_UnicodeEncodeError": 707, "\"su#nns\"": 708, "get_nbo_cast_transfer_function": 709, "src_dtype": 710, "dst_dtype": 711, "move_references": 712, "out_needs_api": 713, "out_needs_wrap": 714, "PyTypeNum_ISNUMBER": 715, "type_num": 716, "PyArray_ISNBO": 717, "byteorder": 718, "NPY_DATETIME": 719, "NPY_TIMEDELTA": 720, "get_nbo_cast_datetime_transfer_function": 721, "NPY_STRING": 722, "get_nbo_datetime_to_string_transfer_function": 723, "NPY_UNICODE": 724, "get_datetime_to_unicode_transfer_function": 725, "get_nbo_string_to_datetime_transfer_function": 726, "get_unicode_to_datetime_transfer_function": 727, "get_legacy_dtype_cast_function": 728, "sock_send": 729, "PySocketSockObject": 730, "n": 731, "flags": 732, "timeout": 733, "PyArg_ParseTuple": 734, "\"s#|i:send\"": 735, "IS_SELECTABLE": 736, "select_error": 737, "Py_BEGIN_ALLOW_THREADS": 738, "internal_select": 739, "__VMS": 740, "sendsegmented": 741, "sock_fd": 742, "Py_END_ALLOW_THREADS": 743, "socket_timeout": 744, "\"timed out\"": 745, "errorhandler": 746, "PyInt_FromLong": 747, "long": 748, "_mean": 749, "keepdims": 750, "arr": 751, "asanyarray": 752, "is_float16_result": 753, "rcount": 754, "_count_reduce_items": 755, "warnings": 756, "warn": 757, "\"Mean of empty slice.\"": 758, "RuntimeWarning": 759, "stacklevel": 760, "trim_zeros": 761, "filt": 762, "trim": 763, "'fb'": 764, "\"\"\"    Trim the leading and/or trailing zeros from a 1-D array or sequence.    Parameters    ----------    filt : 1-D array or sequence        Input array.    trim : str, optional        A string with 'f' representing trim from front and 'b' to trim from        back. Default is 'fb', trim zeros from both front and back of the        array.    Returns    -------    trimmed : 1-D array or sequence        The result of trimming the input. The input data type is preserved.    Examples    --------    >>> a = np.array((0, 0, 0, 1, 2, 3, 0, 2, 1, 0))    >>> np.trim_zeros(a)    array([1, 2, 3, 0, 2, 1])    >>> np.trim_zeros(a, 'b')    array([0, 0, 0, ..., 0, 2, 1])    The input data type is preserved, list/tuple in means list/tuple out.    >>> np.trim_zeros([0, 1, 2, 0])    [1, 2]    \"\"\"": 765, "upper": 766, "'F'": 767, "0.": 768, "last": 769, "'B'": 770, "PyUnicode_Join": 771, "separator": 772, "seq": 773, "internal_separator": 774, "blank": 775, "sep": 776, "seplen": 777, "PyUnicodeObject": 778, "res": 779, "res_alloc": 780, "res_used": 781, "res_p": 782, "fseq": 783, "seqlen": 784, "item": 785, "PySequence_Fast": 786, "PySequence_Fast_GET_SIZE": 787, "_PyUnicode_New": 788, "Done": 789, "PySequence_Fast_GET_ITEM": 790, "PyUnicode_CheckExact": 791, "PyUnicode_FromObject": 792, "onError": 793, "PyUnicode_AS_UNICODE": 794, "PyUnicode_GET_SIZE": 795, "itemlen": 796, "new_res_used": 797, "PyUnicode_Check": 798, "PyString_Check": 799, "\"sequence item %zd: expected string or Unicode,\"": 800, "\" %.80s found\"": 801, "ob_type": 802, "tp_name": 803, "Overflow": 804, "_PyUnicode_Resize": 805, "Py_UNICODE_COPY": 806, "\"join() is too long for a Python string\"": 807, "get_setdstzero_transfer_function": 808, "get_bool_setdstone_transfer_function": 809, "NPY_UNUSED": 810, "_strided_to_strided_move_references": 811, "N": 812, "src_itemsize": 813, "src_ref": 814, "dst_ref": 815, "memcpy": 816, "NPY_DT_DBG_REFTRACE": 817, "\"dec dst ref\"": 818, "\"move src ref\"": 819, "void": 820, "NPY_COPY_PYOBJECT_PTR": 821, "PyUFunc_SetUsesArraysAsData": 822, "DEPRECATE": 823, "\"PyUFunc_SetUsesArraysAsData() C-API function is deprecated \"": 824, "\"and expected to be removed rapidly. If you are using it (i.e. see \"": 825, "\"this warning/error), please notify the NumPy developers. \"": 826, "\"It is currently assumed that this function is simply unused and \"": 827, "\"its removal will facilitate the implementation of better \"": 828, "\"approaches.\"": 829, "PyArray_Zeros": 830, "nd": 831, "dims": 832, "is_f_order": 833, "NPY_DEFAULT_TYPE": 834, "PyArray_NewFromDescr_int": 835, "PyArray_Type": 836, "PyDataType_REFCHK": 837, "_zerofill": 838, "__call__": 839, "__other": 840, "signedinteger": 841, "_NBit": 842, "Union": 843, "_NBit_co": 844, "...": 845, "_SignedIntBitOp": 846, "Protocol": 847, "@": 848, "overload": 849, "bool": 850, "_NBitInt": 851, "_SignedIntMod": 852, "_make_options_dict": 853, "precision": 854, "threshold": 855, "edgeitems": 856, "linewidth": 857, "suppress": 858, "nanstr": 859, "infstr": 860, "sign": 861, "floatmode": 862, "legacy": 863, "\"\"\" make a dictionary out of the non-None arguments, plus sanity checks \"\"\"": 864, "k": 865, "items": 866, "'suppress'": 867, "'fixed'": 868, "'unique'": 869, "'maxprec'": 870, "'maxprec_equal'": 871, "\"floatmode option must be one of \"": 872, "\", \"": 873, "join": 874, "'\"{}\"'": 875, "format": 876, "\"sign option must be one of ' ', '+', or '-'\"": 877, "'1.13'": 878, "\"legacy printing option can currently only be '1.13' or \"": 879, "\"`False`\"": 880, "3": 881, "isinstance": 882, "numbers": 883, "Number": 884, "TypeError": 885, "\"threshold must be numeric\"": 886, "isnan": 887, "\"threshold must be non-NAN, try \"": 888, "\"sys.maxsize for untruncated representation\"": 889, "_column_header": 890, "fmt": 891, "row": 892, "frame": 893, "nlevels": 894, "columns": 895, "MultiIndex": 896, "has_column_names": 897, "append": 898, "single_column_table": 899, "style": 900, "\"text-align: %s;\"": 901, "justify": 902, "extend": 903, "c": 904, "u'Dialog'": 905, "u'Control_Default'": 906, "u'Control'": 907, "u'Defines the default control. Hitting return is equivalent to pushing this button.'": 908, "u'Control_Cancel'": 909, "u'Defines the cancel control. Hitting escape or clicking on the close icon on the dialog is equivalent to pushing this button.'": 910, "u'EventMapping'": 911, "u'Dialog_'": 912, "u'A foreign key to the Dialog table, name of the Dialog.'": 913, "u'Control_'": 914, "u'A foreign key to the Control table, name of the control.'": 915, "u'Event'": 916, "u'An identifier that specifies the type of the event that the control subscribes to.'": 917, "u'Attribute'": 918, "u'The name of the control attribute, that is set when this event is received.'": 919, "u'InstallExecuteSequence'": 920, "u'Name of action to invoke, either in the engine or the handler DLL.'": 921, "u'Sequence'": 922, "u'Number that determines the sort order in which the actions are to be executed.  Leave blank to suppress action.'": 923, "u'Condition'": 924, "u'Optional expression which skips the action if evaluates to expFalse.If the expression syntax is invalid, the engine will terminate, returning iesBadActionData.'": 925, "u'AppSearch'": 926, "u'Property'": 927, "u'The property associated with a Signature'": 928, "u'Signature;RegLocator;IniLocator;DrLocator;CompLocator'": 929, "u'The Signature_ represents a unique file signature and is also the foreign key in the Signature,  RegLocator, IniLocator, CompLocator and the DrLocator tables.'": 930, "u'BindImage'": 931, "u'The index into the File table. This must be an executable file.'": 932, "u'Paths'": 933, "u'A list of ;  delimited paths that represent the paths to be searched for the import DLLS. The list is usually a list of properties each enclosed within square brackets [] .'": 934, "u'CCPSearch'": 935, "u'InstallUISequence'": 936, "u'ListView'": 937, "u'The visible text to be assigned to the item. Optional. If this entry or the entire column is missing, the text is the same as the value.'": 938, "u'A named property to be tied to this item. All the items tied to the same property become part of the same listview.'": 939, "u'The value string associated with this item. Selecting the line will set the associated property to this value.'": 940, "u'Order'": 941, "u'A positive integer used to determine the ordering of the items within one list..The integers do not have to be consecutive.'": 942, "u'Binary_'": 943, "u'Binary'": 944, "u'The name of the icon to be displayed with the icon. The binary information is looked up from the Binary Table.'": 945, "u'RadioButton'": 946, "u'X'": 947, "u'The horizontal coordinate of the upper left corner of the bounding rectangle of the radio button.'": 948, "u'The vertical coordinate of the upper left corner of the bounding rectangle of the radio button.'": 949, "u'Width'": 950, "u'The width of the button.'": 951, "u'Height'": 952, "u'The height of the button.'": 953, "u'The visible title to be assigned to the radio button.'": 954, "u'A named property to be tied to this radio button. All the buttons tied to the same property become part of the same group.'": 955, "u'The value string associated with this button. Selecting the button will set the associated property to this value.'": 956, "u'Help'": 957, "u'The help strings used with the button. The text is optional.'": 958, "u'TextStyle'": 959, "u'Name of the style. The primary key of this table. This name is embedded in the texts to indicate a style change.'": 960, "u'FaceName'": 961, "u'A string indicating the name of the font used. Required. The string must be at most 31 characters long.'": 962, "u'Size'": 963, "u'The size of the font used. This size is given in our units (1/12 of the system font height). Assuming that the system font is set to 12 point size, this is equivalent to the point size.'": 964, "u'Color'": 965, "16777215": 966, "u'A long integer indicating the color of the string in the RGB format (Red, Green, Blue each 0-255, RGB = R + 256*G + 256^2*B).'": 967, "u'StyleBits'": 968, "u'A combination of style bits.'": 969, "u'UIText'": 970, "u'The localized version of the string.'": 971, "u'Key'": 972, "u'A unique key that identifies the particular string.'": 973, "u'_Validation'": 974, "u'Table'": 975, "u'Name of table'": 976, "u'Description'": 977, "u'Description of column'": 978, "u'Column'": 979, "u'Name of column'": 980, "u'Nullable'": 981, "u'Y;N;@'": 982, "u'Whether the column is nullable'": 983, "u'MinValue'": 984, "2147483647": 985, "u'Minimum value allowed'": 986, "u'MaxValue'": 987, "u'Maximum value allowed'": 988, "u'KeyTable'": 989, "u'For foreign key, Name of table to which data must link'": 990, "u'KeyColumn'": 991, "32": 992, "u'Column to which foreign key connects'": 993, "u'Category'": 994, "u'Text;Formatted;Template;Condition;Guid;Path;Version;Language;Identifier;Binary;UpperCase;LowerCase;Filename;Paths;AnyPath;WildCardFilename;RegPath;KeyFormatted;CustomSource;Property;Cabinet;Shortcut;URL'": 995, "u'String category'": 996, "u'Set'": 997, "u'Set of values that are permitted'": 998, "u'AdvtUISequence'": 999, "u'AppId'": 1000, "u'Guid'": 1001, "u'ActivateAtStorage'": 1002, "u'DllSurrogate'": 1003, "u'LocalService'": 1004, "u'RemoteServerName'": 1005, "isfile": 1006, "\"\"\"Test whether a path is a regular file\"\"\"": 1007, "st": 1008, "stat": 1009, "error": 1010, "S_ISREG": 1011, "st_mode": 1012, "string_lower": 1013, "PyStringObject": 1014, "PyString_GET_SIZE": 1015, "newobj": 1016, "PyString_AS_STRING": 1017, "isupper": 1018, "_tolower": 1019, "_buffer_info_t": 1020, "_buffer_info_new": 1021, "info": 1022, "_tmp_string_t": 1023, "malloc": 1024, "PyErr_NoMemory": 1025, "PyArray_IsScalar": 1026, "Datetime": 1027, "Timedelta": 1028, "_append_char": 1029, "\\0": 1030, "ndim": 1031, "shape": 1032, "Generic": 1033, "PyArray_DescrFromScalar": 1034, "PyArray_NDIM": 1035, "PyArray_DIMS": 1036, "PyArray_STRIDES": 1037, "_buffer_format_string": 1038, "free": 1039, "_install_handlers": 1040, "cp": 1041, "formatters": 1042, "\"\"\"Install and return handlers\"\"\"": 1043, "hlist": 1044, "get": 1045, "\"handlers\"": 1046, "\"keys\"": 1047, "string": 1048, "\",\"": 1049, "handlers": 1050, "fixups": 1051, "hand": 1052, "sectname": 1053, "\"handler_%s\"": 1054, "klass": 1055, "\"class\"": 1056, "opts": 1057, "\"formatter\"": 1058, "eval": 1059, "vars": 1060, "logging": 1061, "\"args\"": 1062, "h": 1063, "\"level\"": 1064, "level": 1065, "setLevel": 1066, "_levelNames": 1067, "setFormatter": 1068, "MemoryHandler": 1069, "\"target\"": 1070, "target": 1071, "t": 1072, "setTarget": 1073, "u'AdminRegistrationDlg'": 1074, "u'OrganizationLabel'": 1075, "45": 1076, "71": 1077, "285": 1078, "30": 1079, "u'&Please enter the name of your organization in the box below.  This will be used as default company name for subsequent installations of [ProductName]:'": 1080, "u'OrganizationEdit'": 1081, "u'CDKeyEdit'": 1082, "u'MaskedEdit'": 1083, "143": 1084, "250": 1085, "u'PIDKEY'": 1086, "u'[PIDTemplate]'": 1087, "u'Back'": 1088, "u'CDKeyLabel'": 1089, "130": 1090, "u'CD &Key:'": 1091, "u'Edit'": 1092, "105": 1093, "220": 1094, "18": 1095, "u'COMPANYNAME'": 1096, "u'{80}'": 1097, "u'BrowseDlg'": 1098, "u'Up'": 1099, "u'PushButton'": 1100, "298": 1101, "55": 1102, "19": 1103, "3670019": 1104, "u'NewFolder'": 1105, "u'Up One Level|'": 1106, "u'BannerBitmap'": 1107, "u'Bitmap'": 1108, "374": 1109, "44": 1110, "u'[BannerBitmap]'": 1111, "u'PathEdit'": 1112, "84": 1113, "202": 1114, "261": 1115, "11": 1116, "u'_BrowseProperty'": 1117, "u'OK'": 1118, "u'BannerLine'": 1119, "u'Line'": 1120, "_draw_turtle": 1121, "forward": 1122, "distance": 1123, "\"\"\" Go forward distance steps.        Example:        >>> turtle.position()        [0.0, 0.0]        >>> turtle.forward(25)        >>> turtle.position()        [25.0, 0.0]        >>> turtle.forward(-75)        >>> turtle.position()        [-50.0, 0.0]        \"\"\"": 1124, "x0": 1125, "y0": 1126, "_position": 1127, "x1": 1128, "cos": 1129, "_angle": 1130, "_invradian": 1131, "y1": 1132, "sin": 1133, "_goto": 1134, "backward": 1135, "\"\"\" Go backwards distance steps.        The turtle's heading does not change.        Example:        >>> turtle.position()        [0.0, 0.0]        >>> turtle.backward(30)        >>> turtle.position()        [-30.0, 0.0]        \"\"\"": 1136, "left": 1137, "angle": 1138, "\"\"\" Turn left angle units (units are by default degrees,        but can be set via the degrees() and radians() functions.)        When viewed from above, the turning happens in-place around        its front tip.        Example:        >>> turtle.heading()        22        >>> turtle.left(45)        >>> turtle.heading()        67.0        \"\"\"": 1139, "_fullcircle": 1140, "right": 1141, "\"\"\" Turn right angle units (units are by default degrees,        but can be set via the degrees() and radians() functions.)        When viewed from above, the turning happens in-place around        its front tip.        Example:        >>> turtle.heading()        22        >>> turtle.right(45)        >>> turtle.heading()        337.0        \"\"\"": 1142, "up": 1143, "\"\"\" Pull the pen up -- no drawing when moving.        Example:        >>> turtle.up()        \"\"\"": 1144, "_drawing": 1145, "down": 1146, "\"\"\" Put the pen down -- draw when moving.        Example:        >>> turtle.down()        \"\"\"": 1147, "width": 1148, "\"\"\" Set the line to thickness to width.        Example:        >>> turtle.width(10)        \"\"\"": 1149, "_width": 1150, "color": 1151, "\"\"\" Set the pen color.        Three input formats are allowed:            color(s)            s is a Tk specification string, such as \"red\" or \"yellow\"            color((r, g, b))            *a tuple* of r, g, and b, which represent, an RGB color,            and each of r, g, and b are in the range [0..1]            color(r, g, b)            r, g, and b represent an RGB color, and each of r, g, and b            are in the range [0..1]        Example:        >>> turtle.color('brown')        >>> tup = (0.2, 0.8, 0.55)        >>> turtle.color(tup)        >>> turtle.color(0, .5, 0)        \"\"\"": 1152, "Error": 1153, "\"no color arguments\"": 1154, "id": 1155, "_canvas": 1156, "create_line": 1157, "fill": 1158, "Tkinter": 1159, "TclError": 1160, "\"bad color string: %r\"": 1161, "_set_color": 1162, "r": 1163, "g": 1164, "b": 1165, "\"bad color sequence: %r\"": 1166, "\"bad color arguments: %r\"": 1167, "assert": 1168, "255.0": 1169, "y": 1170, "0.5": 1171, "\"#%02x%02x%02x\"": 1172, "_color": 1173, "text": 1174, "move": 1175, "\"\"\" Write text at the current pen position.        If move is true, the pen is moved to the bottom-right corner        of the text. By default, move is False.        Example:        >>> turtle.write('The race is on!')        >>> turtle.write('Home = (0, 0)', True)        \"\"\"": 1176, "create_text": 1177, "anchor": 1178, "\"sw\"": 1179, "_items": 1180, "bbox": 1181, "flag": 1182, "\"\"\" Call fill(1) before drawing the shape you         want to fill, and fill(0) when done.        Example:        >>> turtle.fill(1)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.fill(0)        \"\"\"": 1183, "_filling": 1184, "tuple": 1185, "_path": 1186, "smooth": 1187, "_create": 1188, "'polygon'": 1189, "'fill'": 1190, "'smooth'": 1191, "begin_fill": 1192, "\"\"\" Called just before drawing a shape to be filled.            Must eventually be followed by a corresponding end_fill() call.            Otherwise it will be ignored.        Example:        >>> turtle.begin_fill()        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.end_fill()        \"\"\"": 1193, "end_fill": 1194, "\"\"\" Called after drawing a shape to be filled.        Example:        >>> turtle.begin_fill()        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.left(90)        >>> turtle.forward(100)        >>> turtle.end_fill()        \"\"\"": 1195, "circle": 1196, "radius": 1197, "extent": 1198, "\"\"\" Draw a circle with given radius.        The center is radius units left of the turtle; extent        determines which part of the circle is drawn. If not given,        the entire circle is drawn.        If extent is not a full circle, one endpoint of the arc is the        current pen position. The arc is drawn in a counter clockwise        direction if radius is positive, otherwise in a clockwise        direction. In the process, the direction of the turtle is        changed by the amount of the extent.        >>> turtle.circle(50)        >>> turtle.circle(120, 180)  # half a circle        \"\"\"": 1199, "frac": 1200, "abs": 1201, "/": 1202, "steps": 1203, "min": 1204, "6.0": 1205, "59.0": 1206, "w": 1207, "1.0": 1208, "w2": 1209, "2.0": 1210, "range": 1211, "heading": 1212, "\"\"\" Return the turtle's current heading.        Example:        >>> turtle.heading()        67.0        \"\"\"": 1213, "setheading": 1214, "\"\"\" Set the turtle facing the given angle.        Here are some common directions in degrees:           0 - east          90 - north         180 - west         270 - south        Example:        >>> turtle.setheading(90)        >>> turtle.heading()        90        >>> turtle.setheading(128)        >>> turtle.heading()        128        \"\"\"": 1215, "window_width": 1216, "\"\"\" Returns the width of the turtle window.        Example:        >>> turtle.window_width()        640        \"\"\"": 1217, "winfo_width": 1218, "'width'": 1219, "window_height": 1220, "\"\"\" Return the height of the turtle window.        Example:        >>> turtle.window_height()        768        \"\"\"": 1221, "height": 1222, "winfo_height": 1223, "'height'": 1224, "position": 1225, "\"\"\" Return the current (x, y) location of the turtle.        Example:        >>> turtle.position()        [0.0, 240.0]        \"\"\"": 1226, "_origin": 1227, "setx": 1228, "xpos": 1229, "\"\"\" Set the turtle's x coordinate to be xpos.        Example:        >>> turtle.position()        [10.0, 240.0]        >>> turtle.setx(10)        >>> turtle.position()        [10.0, 240.0]        \"\"\"": 1230, "sety": 1231, "ypos": 1232, "\"\"\" Set the turtle's y coordinate to be ypos.        Example:        >>> turtle.position()        [0.0, 0.0]        >>> turtle.sety(-22)        >>> turtle.position()        [0.0, -22.0]        \"\"\"": 1233, "towards": 1234, "\"\"\"Returs the angle, which corresponds to the line        from turtle-position to point (x,y).        Argument can be two coordinates or one pair of coordinates        or a RawPen/Pen instance.        Example:        >>> turtle.position()        [10.0, 10.0]        >>> turtle.towards(0,0)        225.0        \"\"\"": 1235, "arg": 1236, "RawPen": 1237, "dx": 1238, "dy": 1239, "atan2": 1240, "\"\"\" Go to the given point.        If the pen is down, then a line will be drawn. The turtle's        orientation does not change.        Two input formats are accepted:           goto(x, y)           go to point (x, y)           goto((x, y))           go to point (x, y)        Example:        >>> turtle.position()        [0.0, 0.0]        >>> turtle.goto(50, -45)        >>> turtle.position()        [50.0, -45.0]        \"\"\"": 1241, "\"bad point argument: %r\"": 1242, "\"bad coordinates: %r\"": 1243, "_tracing": 1244, "hypot": 1245, "nhops": 1246, "capstyle": 1247, "\"round\"": 1248, "coords": 1249, "update": 1250, "after": 1251, "_delay": 1252, "itemconfigure": 1253, "arrow": 1254, "\"none\"": 1255, "speed": 1256, "\"\"\" Set the turtle's speed.        speed must one of these five strings:            'fastest' is a 0 ms delay            'fast' is a 5 ms delay            'normal' is a 10 ms delay            'slow' is a 15 ms delay            'slowest' is a 20 ms delay         Example:         >>> turtle.speed('slow')        \"\"\"": 1257, "lower": 1258, "speeds": 1259, "\"%r is not a valid speed. speed must be \"": 1260, "\"one of %s\"": 1261, "delay": 1262, "\"\"\" Set the drawing delay in milliseconds.        This is intended to allow finer control of the drawing speed        than the speed() method        Example:        >>> turtle.delay(15)        \"\"\"": 1263, "\"delay must be greater than or equal to 0\"": 1264, "_delete_turtle": 1265, "_arrow": 1266, "\"last\"": 1267, "delete": 1268, "_root": 1269, "_pen": 1270, "0.50": 1271, "_height": 1272, "0.75": 1273, "_startx": 1274, "_starty": 1275, "_title": 1276, "\"Turtle Graphics\"": 1277, "Pen": 1278, "global": 1279, "Tk": 1280, "wm_protocol": 1281, "\"WM_DELETE_WINDOW\"": 1282, "_destroy": 1283, "title": 1284, "Canvas": 1285, "background": 1286, "\"white\"": 1287, "expand": 1288, "\"both\"": 1289, "startx": 1290, "starty": 1291, "root": 1292, "destroy": 1293, "_getpen": 1294, "Turtle": 1295, "\"\"\"For documentation of the following functions see   the RawPen methods with the same names\"\"\"": 1296, "degrees": 1297, "radians": 1298, "reset": 1299, "clear": 1300, "tracer": 1301, "done": 1302, "mainloop": 1303, "methodname": 1304, "dir": 1305, "\"\"\" copies RawPen docstrings to module functions of same name \"\"\"": 1306, "\"_\"": 1307, "__doc__": 1308, "__dict__": 1309, "geometry": 1310, "\"\"\" Sets the size and position of the main window.    Keywords are width, height, startx and starty:    width: either a size in pixels or a fraction of the screen.      Default is 50% of screen.    height: either the height in pixels or a fraction of the screen.      Default is 75% of screen.    Setting either width or height to None before drawing will force      use of default geometry as in older versions of turtle.py    startx: starting position in pixels from the left edge of the screen.      Default is to center window. Setting startx to None is the default      and centers window horizontally on screen.    starty: starting position in pixels from the top edge of the screen.      Default is to center window. Setting starty to None is the default      and centers window vertically on screen.    Examples:    >>> setup (width=200, height=200, startx=0, starty=0)    sets window to 200x200 pixels, in upper left of screen    >>> setup(width=.75, height=0.5, startx=None, starty=None)    sets window to 75% of screen by 50% of screen and centers    >>> setup(width=None)    forces use of default geometry as in older versions of turtle.py    \"\"\"": 1311, "\"width can not be less than 0\"": 1312, "\"height can not be less than 0\"": 1313, "'startx'": 1314, "\"startx can not be less than 0\"": 1315, "'starty'": 1316, "winfo_screenwidth": 1317, "winfo_screenheight": 1318, "\"%dx%d+%d+%d\"": 1319, "\"\"\"Set the window title.    By default this is set to 'Turtle Graphics'    Example:    >>> title(\"My Window\")    \"\"\"": 1320, "demo": 1321, "j": 1322, "20": 1323, "90": 1324, "\"maroon\"": 1325, "\"black\"": 1326, "180": 1327, "\"startstart\"": 1328, "\"start\"": 1329, "\"red\"": 1330, "\"end\"": 1331, "demo2": 1332, "'fast'": 1333, ".5": 1334, "pendown": 1335, "sleep": 1336, "\"green\"": 1337, "sp": 1338, "0.05": 1339, "120": 1340, "0.25": 1341, "70": 1342, "\"fastest\"": 1343, "\"yellow\"": 1344, "turtle": 1345, "'normal'": 1346, "280": 1347, "40": 1348, "24": 1349, "\"blue\"": 1350, "'fastest'": 1351, "3.5": 1352, "0.6": 1353, "\"CAUGHT! \"": 1354, "__name__": 1355, "'__main__'": 1356, "time": 1357, "_stack_dispatcher": 1358, "arrays": 1359, "_arrays_for_stack_dispatcher": 1360, "6": 1361, "yield": 1362, "get_supported_platform": 1363, "\"\"\"Return this platform's maximum compatible version.    distutils.util.get_platform() normally reports the minimum version    of Mac OS X that would be required to *use* extensions produced by    distutils.  But what we want when checking compatibility is to know the    version of Mac OS X that we are *running*.  To allow usage of packages that    explicitly require a newer version of Mac OS X, we must also know the    current version of the OS.    If this condition occurs for any other platform with a version in its    platform strings, this function should be extended accordingly.    \"\"\"": 1364, "plat": 1365, "get_build_platform": 1366, "macosVersionString": 1367, "sys": 1368, "platform": 1369, "\"darwin\"": 1370, "'macosx-%s-%s'": 1371, "_macosx_vers": 1372, "__all__": 1373, "PyErr_PrintEx": 1374, "set_sys_last_vars": 1375, "exception": 1376, "tb": 1377, "hook": 1378, "PyErr_ExceptionMatches": 1379, "PyExc_SystemExit": 1380, "handle_system_exit": 1381, "PyErr_Fetch": 1382, "PyErr_NormalizeException": 1383, "PySys_SetObject": 1384, "\"last_type\"": 1385, "\"last_value\"": 1386, "\"last_traceback\"": 1387, "PySys_GetObject": 1388, "\"excepthook\"": 1389, "PyEval_CallObject": 1390, "exception2": 1391, "v2": 1392, "tb2": 1393, "Py_FlushLine": 1394, "PyErr_Clear": 1395, "fflush": 1396, "\"Error in sys.excepthook:\\n\"": 1397, "PyErr_Display": 1398, "\"\\nOriginal exception was:\\n\"": 1399, "\"sys.excepthook is missing\\n\"": 1400, "_maybe_compile": 1401, "compiler": 1402, "filename": 1403, "symbol": 1404, "\"\\n\"": 1405, "'#'": 1406, "\"eval\"": 1407, "\"pass\"": 1408, "err1": 1409, "err2": 1410, "code1": 1411, "code2": 1412, "SyntaxError": 1413, "feature": 1414, "include_by_default": 1415, "excdef": 1416, "incdef": 1417, "__getitem__": 1418, "indx": 1419, "nt": 1420, "fields": 1421, "view": 1422, "__class__": 1423, "format_exception_only": 1424, "etype": 1425, "value": 1426, "\"\"\"Format the exception part of a traceback.    The arguments are the exception type and value such as given by    sys.last_type and sys.last_value. The return value is a list of    strings, each ending in a newline.  Normally, the list contains a    single string; however, for SyntaxError exceptions, it contains    several lines that (when printed) display detailed information    about where the syntax error occurred.  The message indicating    which exception occurred is the always last string in the list.    \"\"\"": 1427, "types": 1428, "ClassType": 1429, "issubclass": 1430, "Exception": 1431, "stype": 1432, "lineno": 1433, "offset": 1434, "\"<string>\"": 1435, "'  File \"%s\", line %d\\n'": 1436, "isspace": 1437, "'    %s\\n'": 1438, "'    '": 1439, "'%s^\\n'": 1440, "_some_str": 1441, "'%s: %s\\n'": 1442, "'%s\\n'": 1443, "signbit": 1444, "double": 1445, "union": 1446, "short": 1447, "#if": 1448, "SIZEOF_INT": 1449, "WORDS_BIGENDIAN": 1450, "radb2": 1451, "ido": 1452, "l1": 1453, "Treal": 1454, "cc": 1455, "wa1": 1456, "ic": 1457, "ti2": 1458, "tr2": 1459, "ref": 1460, "-2": 1461, "radf3": 1462, "wa2": 1463, "taur": 1464, "-0.5": 1465, "taui": 1466, "0.86602540378443864676": 1467, "ci2": 1468, "di2": 1469, "di3": 1470, "cr2": 1471, "dr2": 1472, "dr3": 1473, "ti3": 1474, "tr3": 1475, "radb3": 1476, "ci3": 1477, "cr3": 1478, "radf4": 1479, "wa3": 1480, "hsqt2": 1481, "0.70710678118654752440": 1482, "ci4": 1483, "cr4": 1484, "ti1": 1485, "ti4": 1486, "tr1": 1487, "tr4": 1488, "radb4": 1489, "sqrt2": 1490, "1.41421356237309504880": 1491, "radf5": 1492, "wa4": 1493, "tr11": 1494, "0.3090169943749474241": 1495, "ti11": 1496, "0.95105651629515357212": 1497, "tr12": 1498, "-0.8090169943749474241": 1499, "ti12": 1500, "0.58778525229247312917": 1501, "ci5": 1502, "di4": 1503, "di5": 1504, "dr4": 1505, "dr5": 1506, "cr5": 1507, "ti5": 1508, "tr5": 1509, "radb5": 1510, "radfg": 1511, "ip": 1512, "idl1": 1513, "wa": 1514, "idij": 1515, "ipph": 1516, "j2": 1517, "jc": 1518, "lc": 1519, "ik": 1520, "nbd": 1521, "dc2": 1522, "ai1": 1523, "ai2": 1524, "ar1": 1525, "ar2": 1526, "ds2": 1527, "dcp": 1528, "dsp": 1529, "ar1h": 1530, "ar2h": 1531, "sincos2pi": 1532, "radbg": 1533, "cfftf1": 1534, "ifac": 1535, "MAXFAC": 1536, "isign": 1537, "idot": 1538, "k1": 1539, "l2": 1540, "na": 1541, "nf": 1542, "iw": 1543, "ix2": 1544, "ix3": 1545, "ix4": 1546, "nac": 1547, "cinput": 1548, "coutput": 1549, "passf4": 1550, "passf2": 1551, "passf3": 1552, "passf5": 1553, "passf": 1554, "NPY_VISIBILITY_HIDDEN": 1555, "npy_cfftf": 1556, "wsave": 1557, "iw1": 1558, "iw2": 1559, "npy_cfftb": 1560, "+1": 1561, "factorize": 1562, "ntryh": 1563, "NSPECIAL": 1564, "ntry": 1565, "ib": 1566, "nl": 1567, "nq": 1568, "nr": 1569, "startloop": 1570, "cffti1": 1571, "fi": 1572, "i1": 1573, "ld": 1574, "ii": 1575, "ipm": 1576, "npy_cffti": 1577, "rfftf1": 1578, "kh": 1579, "radf2": 1580, "rfftb1": 1581, "npy_rfftf": 1582, "npy_rfftb": 1583, "rffti1": 1584, "nfm1": 1585, "npy_rffti": 1586, "__cplusplus": 1587, "time_strftime": 1588, "tup": 1589, "tm": 1590, "fmtlen": 1591, "buflen": 1592, "outbuf": 1593, "\"s|O:strftime\"": 1594, "time_t": 1595, "tt": 1596, "localtime": 1597, "gettmarg": 1598, "tm_mon": 1599, "\"month out of range\"": 1600, "tm_mday": 1601, "\"day of month out of range\"": 1602, "tm_hour": 1603, "23": 1604, "\"hour out of range\"": 1605, "tm_min": 1606, "59": 1607, "\"minute out of range\"": 1608, "tm_sec": 1609, "61": 1610, "\"seconds out of range\"": 1611, "tm_wday": 1612, "\"day of week out of range\"": 1613, "tm_yday": 1614, "365": 1615, "\"day of year out of range\"": 1616, "tm_isdst": 1617, "\"daylight savings flag out of range\"": 1618, "1024": 1619, "strftime": 1620, "assert_relative": 1621, "isabs": 1622, "errors": 1623, "DistutilsSetupError": 1624, "is_expired": 1625, "now": 1626, "expires": 1627, "PyUnicodeEncodeError_GetEncoding": 1628, "exc": 1629, "get_string": 1630, "\"encoding\"": 1631, "_PyCodec_Lookup": 1632, "PyInterpreterState": 1633, "interp": 1634, "PyErr_BadArgument": 1635, "PyThreadState_GET": 1636, "codec_search_path": 1637, "_PyCodecRegistry_Init": 1638, "normalizestring": 1639, "PyString_InternInPlace": 1640, "codec_search_cache": 1641, "PyTuple_New": 1642, "PyTuple_SET_ITEM": 1643, "PyList_Size": 1644, "PyExc_LookupError": 1645, "\"no codec search functions registered: \"": 1646, "\"can't find encoding\"": 1647, "func": 1648, "PyList_GetItem": 1649, "continue": 1650, "PyTuple_Check": 1651, "PyTuple_GET_SIZE": 1652, "\"codec search functions must return 4-tuples\"": 1653, "\"unknown encoding: %s\"": 1654, "PyDict_SetItem": 1655, "generate_range": 1656, "periods": 1657, "datetools": 1658, "BDay": 1659, "time_rule": 1660, "\"\"\"    Generates a sequence of dates corresponding to the specified time    offset. Similar to dateutil.rrule except uses pandas DateOffset    objects to represent time increments    Parameters    ----------    start : datetime (default None)    end : datetime (default None)    periods : int, optional    Note    ----    * This method is faster for generating weekdays than dateutil.rrule    * At least two of (start, end, periods) must be specified.    * If both start and end are specified, the returned dates will    satisfy start <= date <= end.    Returns    -------    dates : generator object    See also    --------    DateRange, dateutil.rrule    \"\"\"": 1661, "getOffset": 1662, "_offsetNames": 1663, "to_datetime": 1664, "onOffset": 1665, "rollforward": 1666, "rollback": 1667, "linkcode_resolve": 1668, "domain": 1669, "\"\"\"    Determine the URL corresponding to Python object    \"\"\"": 1670, "'py'": 1671, "modname": 1672, "'module'": 1673, "fullname": 1674, "'fullname'": 1675, "submod": 1676, "modules": 1677, "part": 1678, "unwrap": 1679, "inspect": 1680, "fn": 1681, "compile": 1682, "modulename": 1683, "'untitled'": 1684, "extra_args": 1685, "verbose": 1686, "source_fn": 1687, "extension": 1688, "'.f'": 1689, "Build": 1690, "module": 1691, "Fortran": 1692, "77": 1693, "f2py": 1694, "_convert_when": 1695, "when": 1696, "ndarray": 1697, "_when_to_num": 1698, "KeyError": 1699, "inline": 1700, "write_to_peer": 1701, "fd": 1702, "write_finished": 1703, "false": 1704, "talk_data": 1705, "num_writes": 1706, "PeerWriteData": 1707, "wd": 1708, "writes": 1709, "failed": 1710, " { write_finished = true; log_error(\"%s\", msg); wd->finished = true; break; }": 1711, "ssize_t": 1712, "sz": 1713, "MSG_NOSIGNAL": 1714, "\"send() to peer failed to send any data\"": 1715, "errno": 1716, "EINTR": 1717, "perror": 1718,